Revit 2025 API
ExternalDataInstanceAddingIntoDocumentEventArgs Properties
The ExternalDataInstanceAddingIntoDocumentEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
Document |  The document associated with the event.
(Inherited from RevitAPIPreDocEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
TypeId |  The type id of the newl external data instance that is being added.
Top
See Also
Reference
ExternalDataInstanceAddingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace